//for testing purpose only

export const placeholderMovies = [
  {
    id: 1,
    nameRU: "«Роллинг Стоунз» в изгнании",
    nameEN: "Stones in Exile",
    director: "Стивен Кайак ",
    country: "США",
    year: "2010",
    duration: 61,
    description:
      "В конце 1960-х группа «Роллинг Стоунз», несмотря на все свои мегахиты и сверхуспешные концертные туры, была разорена. Виной всему — бездарный менеджмент и драконовское налогообложение в Британии. Тогда музыканты приняли не самое простое для себя решение: летом 1971 года после выхода альбома «Stiсky Fingers» они отправились на юг Франции записывать новую пластинку. Именно там, на Лазурном Берегу, в арендованном Китом Ричардсом подвале виллы Неллькот родился сборник «Exile on Main St.», который стал лучшим альбомом легендарной группы.",
    trailerLink: "https://www.youtube.com/watch?v=UXcqcdYABFw",
    created_at: "2020-11-23T14:12:21.376Z",
    updated_at: "2020-11-23T14:12:21.376Z",
    image:
      "https://upload.wikimedia.org/wikipedia/commons/7/70/Kustodiev_The_Bolshevik.jpg",
  },
  {
    id: 2,
    nameRU: "All Tomorrow's Parties",
    nameEN: "All Tomorrow's Parties",
    director: " Джонатан Кауэтт",
    country: "Великобритания",
    year: "2009",
    duration: 82,
    description:
      "Хроники британского фестиваля, который первым нарушил монополию «Гластонбери», «Ридинга» и прочих пивных сборищ в чистом поле — и с тех пор прослыл одним из самых независимых и принципиальных. ATP из года в год проходит на базе отдыха в английской глуши, где артисты и их поклонники живут в одинаковых номерах, не бывает коммерческих спонсоров, программу составляют приглашенные кураторы (в разное время ими были Ник Кейв, Belle & Sebastian, Sonic Youth и даже Мэтт Грейнинг). И, главное, где не любят вздорных людей — основатель фестиваля Барри Хоган однажды сказал, что никогда больше не станет иметь дело с группой Killing Joke, «потому что они му...аки». Эта демократичность сказалась и на фильме: часть съемок сделана адептами фестиваля на мобильный телефон.",
    trailerLink: "https://www.youtube.com/watch?v=D5fBhbEJxEU",
    created_at: "2020-11-23T14:15:19.238Z",
    updated_at: "2020-11-23T14:15:19.238Z",
    image:
      "https://upload.wikimedia.org/wikipedia/commons/7/70/Kustodiev_The_Bolshevik.jpg",
  },
  {
    id: 3,
    nameRU: " Без обратного пути",
    nameEN: "No Distance Left to Run",
    director: "Уилл Лавлейс, Дилан Сотерн",
    country: "Великобритания",
    year: "2010",
    duration: 104,
    description:
      "Затеянный по такому подозрительному поводу, как реюнион Blur в 2009-м году фильм начисто лишен присущего моменту пафоса и выхолощенности речей. Вернее, что-то похожее неизбежно возникает, когда ты видишь, как забитый до отказа Гайд-парк как в последний раз ревет «Song 2», но это лишь буквальное свидетельство того, что Blur — великая группа. К счастью, помимо прямых и косвенных свидетельств этого, в «No Distance Left to Run» хватает острых углов, неловких моментов и всего того сора, из которого рождаются по-настоящему отличные группы: помимо важных, но общеизвестных моментов (вроде соперничества с Oasis за первенство в том же бритпопе) визуализируются и те, что всегда оставались за кадром: наркотическая зависимость, неутихающие костры амбиций, ревность, обиды, слава — и все это блестяще снято на фоне истории того, что вообще происходило в Британии времен Блэра.",
    trailerLink: "https://www.youtube.com/watch?v=6iYxdghpJZY",
    created_at: "2020-11-23T14:17:23.257Z",
    updated_at: "2020-11-23T14:17:23.257Z",
    image:
      "https://upload.wikimedia.org/wikipedia/commons/7/70/Kustodiev_The_Bolshevik.jpg",
  },
  {
    id: 4,
    nameRU: "Bassweight",
    nameEN: "Bassweight",
    director: "Сурид Хассан",
    country: "Великобритания",
    year: "2008",
    duration: 61,
    description:
      "Фильм про самую многообещающую музыкальную субкультуру нулевых использует тот же ассоциативный ряд, что и искомая музыка: низкое, затянутое облаками небо южного Лондона, приглушенный свет, массивный бас, удары которого отдаются в грудной клетке, негромкая речь людей, предпочитающих не показывать свои лица. Впрочем, все ключевые для дабстепа люди здесь, конечно, имеются — Бенга, Скрим, Kode 9, Мэри Энн Хоббс и прочие, а география не сводится к одному только Кройдону — следом за исторической родиной дабстепа режиссер фильма исследует и другие очаги возгорания, включая Бразилию и Японию.",
    trailerLink: "https://www.youtube.com/watch?v=dgSyC6me-jQ",
    created_at: "2020-12-02T16:48:01.794Z",
    updated_at: "2020-12-02T16:48:01.794Z",
    image:
      "https://upload.wikimedia.org/wikipedia/commons/7/70/Kustodiev_The_Bolshevik.jpg",
  },
  {
    id: 5,
    nameRU: "Taqwacore: The Birth of Punk Islam",
    nameEN: "Taqwacore: The Birth of Punk Islam",
    director: " Омар Маджид",
    country: "Канада",
    year: "2009",
    duration: 80,
    description:
      "**Don't panic, we're Islamic!**\nПакистанские лесбиянки из Ванкувера, арабские хеви-металлисты из Чикаго, группа Vote Hezbollah, ведомая иранцем из Сан-Антонио, — все это невымышленные, сплошь настоящие персонажи, запечатленные в первом документальном свидетельстве о субкультуре исламского панка. Хотя до недавнего времени исламский панк, он же taqwacore, был художественным вымыслом, вышедшим из-под пера писателя-мусульманина Майкла Мухаммеда Найта, его книга сделала это явление вполне реальным, тогда как сам он стал главным героем фильма.\n",
    trailerLink: "https://www.youtube.com/watch?v=JMZ8DO9F4Mo",
    created_at: "2020-12-02T20:35:14.745Z",
    updated_at: "2020-12-02T20:35:14.745Z",
    image:
      "https://upload.wikimedia.org/wikipedia/commons/7/70/Kustodiev_The_Bolshevik.jpg",
  },
  {
    id: 6,
    nameRU: "Фавела на взрыве",
    nameEN: "Favela on Blast",
    director: "Уэсли Пенц",
    country: "Бразилия",
    year: "2008",
    duration: 80,
    description:
      "**Визионер из трущоб**\nГимн бразильским гетто (они же фавелы), породившим байле-фанк — взбалмошную смесь музыки стран третьего мира, нелегального рейва и злого фанка, на волне которого вышли в люди Майя и Сантиголд. Снял фильм не кто иной, как Дипло (он же Уэсли Пенц) — диджей, продюсер и крестный отец двух вышеупомянутых артисток. Поэтому неудивительно, что вместо истории жанра в сухом остатке у него вышла увлекательная этнографическая экспедиция в трущобы Рио-де-Жанейро, где наркотики, секс и зашкаливающий уровень преступности играют в становлении байле-фанка не меньшую роль, чем сама музыка.\n",
    trailerLink: "https://www.youtube.com/watch?v=Cugdwa7mndA",
    created_at: "2020-12-02T20:37:33.665Z",
    updated_at: "2020-12-02T20:37:33.665Z",
    image:
      "https://upload.wikimedia.org/wikipedia/commons/7/70/Kustodiev_The_Bolshevik.jpg",
  },
  {
    id: 7,
    nameRU: "Постеры, сошедшие со стен",
    nameEN: "The Posters Came from the Walls",
    director: "Джереми Деллер, Николас Абрахамс",
    country: "Великобритания",
    year: "2008",
    duration: 72,
    description:
      "**Depeche Mode как смысл жизни**\nКругосветная панорама, показывающая обычаи и традиции поклонников Depeche Mode по всему миру: от России до Ирана. Отправившись снимать парадную картину, рассказывающую о том, как любят группу Depeche Mode за пределами Британии, авторы фильма столкнулись с тем, что любовь эта подчас носит очень личный — и в то же время общенациональный — характер.\n",
    trailerLink: "https://www.youtube.com/watch?v=VFMU3crg0sM",
    created_at: "2020-12-02T20:40:08.342Z",
    updated_at: "2020-12-02T20:40:08.342Z",
    image:
      "https://upload.wikimedia.org/wikipedia/commons/7/70/Kustodiev_The_Bolshevik.jpg",
  },
];




export const placeholderSavedMovies = [
  {
    id: 1,
    nameRU: "«Роллинг Стоунз» в изгнании",
    nameEN: "Stones in Exile",
    director: "Стивен Кайак ",
    country: "США",
    year: "2010",
    duration: 61,
    description:
      "В конце 1960-х группа «Роллинг Стоунз», несмотря на все свои мегахиты и сверхуспешные концертные туры, была разорена. Виной всему — бездарный менеджмент и драконовское налогообложение в Британии. Тогда музыканты приняли не самое простое для себя решение: летом 1971 года после выхода альбома «Stiсky Fingers» они отправились на юг Франции записывать новую пластинку. Именно там, на Лазурном Берегу, в арендованном Китом Ричардсом подвале виллы Неллькот родился сборник «Exile on Main St.», который стал лучшим альбомом легендарной группы.",
    trailerLink: "https://www.youtube.com/watch?v=UXcqcdYABFw",
    created_at: "2020-11-23T14:12:21.376Z",
    updated_at: "2020-11-23T14:12:21.376Z",
    image:
      "https://upload.wikimedia.org/wikipedia/commons/7/70/Kustodiev_The_Bolshevik.jpg",
  },
  {
    id: 2,
    nameRU: "All Tomorrow's Parties",
    nameEN: "All Tomorrow's Parties",
    director: " Джонатан Кауэтт",
    country: "Великобритания",
    year: "2009",
    duration: 82,
    description:
      "Хроники британского фестиваля, который первым нарушил монополию «Гластонбери», «Ридинга» и прочих пивных сборищ в чистом поле — и с тех пор прослыл одним из самых независимых и принципиальных. ATP из года в год проходит на базе отдыха в английской глуши, где артисты и их поклонники живут в одинаковых номерах, не бывает коммерческих спонсоров, программу составляют приглашенные кураторы (в разное время ими были Ник Кейв, Belle & Sebastian, Sonic Youth и даже Мэтт Грейнинг). И, главное, где не любят вздорных людей — основатель фестиваля Барри Хоган однажды сказал, что никогда больше не станет иметь дело с группой Killing Joke, «потому что они му...аки». Эта демократичность сказалась и на фильме: часть съемок сделана адептами фестиваля на мобильный телефон.",
    trailerLink: "https://www.youtube.com/watch?v=D5fBhbEJxEU",
    created_at: "2020-11-23T14:15:19.238Z",
    updated_at: "2020-11-23T14:15:19.238Z",
    image:
      "https://upload.wikimedia.org/wikipedia/commons/7/70/Kustodiev_The_Bolshevik.jpg",
  }
];
